In [1]:
# Importing the sqlite3 library
import sqlite3

# Step 1: Connect to SQLite Database
conn = sqlite3.connect('company_database.db')
print("Opened database successfully")

# Step 2: Create Company Table
conn.execute('''
CREATE TABLE IF NOT EXISTS Company
(ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
ADRESS CHAR(50),
SALARY REAL);''')

print("Table created successfully")

Opened database successfully
Table created successfully

In [2]:
# Step 3: Insert Data into Company Table
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADRESS, SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00)")
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADRESS, SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00)")
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADRESS, SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00)")
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADRESS, SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond', 65000.00)")

conn.commit()
print("Records inserted successfully")

Records inserted successfully

In [4]:
# Step 4: Extract Information from Company Table
cursor = conn.execute("SELECT ID, NAME, AGE, ADRESS, SALARY from Company")
for row in cursor:
  print("ID \t= ", row[0])
  print("NAME \t= ", row[1])
  print("AGE \t= ", row[2])
  print("ADRESS \t= ", row[3])
  print("SALARY \t= ", row[4], "\n")
# Close the database connection
conn.close()

ID 	=  1
NAME 	=  Paul
AGE 	=  32
ADRESS 	=  California
SALARY 	=  20000.0

ID 	=  2
NAME 	=  Allen
AGE 	=  25
ADRESS 	=  Texas
SALARY 	=  15000.0

ID 	=  3
NAME 	=  Teddy
AGE 	=  23
ADRESS 	=  Norway
SALARY 	=  20000.0

ID 	=  4
NAME 	=  Mark
AGE 	=  25
ADRESS 	=  Rich-Mond
SALARY 	=  65000.0